mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf46xk/mb9bf46xk.svd
        <!-- REGISTER "IRQ103MON" -->
        <register>
          <name>IRQ103MON</name>
          <description>IRQ103 Batch Read Register [BHW]</description>
          <addressOffset>0x3A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT8_RX" -->
            <field>
              <name>MFSINT8_RX</name>
              <description>Reception interrupt request of the MFS ch.8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ104MON" -->
        <register>
          <name>IRQ104MON</name>
          <description>IRQ104 Batch Read Register [BHW]</description>
          <addressOffset>0x3A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT8_STATUS" -->
            <field>
              <name>MFSINT8_STATUS</name>
              <description>Status interrupt request of the MFS ch.8</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT8_TX" -->
            <field>
              <name>MFSINT8_TX</name>
              <description>Transmission interrupt request of the MFS ch.8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ105MON" -->
        <register>
          <name>IRQ105MON</name>
          <description>IRQ105 Batch Read Register [BHW]</description>
          <addressOffset>0x3A8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT9_RX" -->
            <field>
              <name>MFSINT9_RX</name>
              <description>Reception interrupt request of the MFS ch.9</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ106MON" -->
        <register>
          <name>IRQ106MON</name>
          <description>IRQ106 Batch Read Register [BHW]</description>
          <addressOffset>0x3AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT9_STATUS" -->
            <field>
              <name>MFSINT9_STATUS</name>
              <description>Status interrupt request of the MFS ch.9</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT9_TX" -->
            <field>
              <name>MFSINT9_TX</name>
              <description>Transmission interrupt request of the MFS ch.9</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ107MON" -->
        <register>
          <name>IRQ107MON</name>
          <description>IRQ107 Batch Read Register [BHW]</description>
          <addressOffset>0x3B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT10_RX" -->
            <field>
              <name>MFSINT10_RX</name>
              <description>Reception interrupt request of the MFS ch.10</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ108MON" -->
        <register>
          <name>IRQ108MON</name>
          <description>IRQ108 Batch Read Register [BHW]</description>
          <addressOffset>0x3B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT10_STATUS" -->
            <field>
              <name>MFSINT10_STATUS</name>
              <description>Status interrupt request of the MFS ch.10</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT10_TX" -->
            <field>
              <name>MFSINT10_TX</name>
              <description>Transmission interrupt request of the MFS ch.10</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ109MON" -->
        <register>
          <name>IRQ109MON</name>
          <description>IRQ109 Batch Read Register [BHW]</description>
          <addressOffset>0x3B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT11_RX" -->
            <field>
              <name>MFSINT11_RX</name>
              <description>Reception interrupt request of the MFS ch.11</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ110MON" -->
        <register>
          <name>IRQ110MON</name>
          <description>IRQ110 Batch Read Register [BHW]</description>
          <addressOffset>0x3BC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT11_STATUS" -->
            <field>
              <name>MFSINT11_STATUS</name>
              <description>Status interrupt request of the MFS ch.11</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT11_TX" -->
            <field>
              <name>MFSINT11_TX</name>
              <description>Transmission interrupt request of the MFS ch.11</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
