mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf46xk/mb9bf46xk.svd
        <!-- REGISTER "HIBRST" -->
        <register>
          <name>HIBRST</name>
          <description>Hibernation Start Register [BHW]</description>
          <addressOffset>0x98</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HIBRST" -->
            <field>
              <name>HIBRST</name>
              <description>Hibernation start bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBPFR" -->
        <register>
          <name>VBPFR</name>
          <description>Port Function Set Register [BHW]</description>
          <addressOffset>0x9C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x1C</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SPSR" -->
            <field>
              <name>SPSR</name>
              <description>Oscillation pin function set bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPFR3" -->
            <field>
              <name>VPFR3</name>
              <description>Port function of P46/X0A pin set bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPFR2" -->
            <field>
              <name>VPFR2</name>
              <description>Port function of P47/X1A pin set bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPFR1" -->
            <field>
              <name>VPFR1</name>
              <description>Port function of P49/VWAKEUP pin set bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPFR0" -->
            <field>
              <name>VPFR0</name>
              <description>Port function of P48/VREGCTL pin set bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBPCR" -->
        <register>
          <name>VBPCR</name>
          <description>Pull-up Set Register [BHW]</description>
          <addressOffset>0xA0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VPCR3" -->
            <field>
              <name>VPCR3</name>
              <description>P46/X0A pin pull-up set bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPCR2" -->
            <field>
              <name>VPCR2</name>
              <description>P47/X1A pin pull-up set bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPCR1" -->
            <field>
              <name>VPCR1</name>
              <description>P49/VWAKEUP pin pull-up set bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPCR0" -->
            <field>
              <name>VPCR0</name>
              <description>P48/VREGCTL pin pull-up set bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBDDR" -->
        <register>
          <name>VBDDR</name>
          <description>Port I/O Direction Set Register [BHW]</description>
          <addressOffset>0xA4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VDDR3" -->
            <field>
              <name>VDDR3</name>
              <description>Port direction of P46/X0A pin set bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDDR2" -->
            <field>
              <name>VDDR2</name>
              <description>Port direction of P47/X1A pin set bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDDR1" -->
            <field>
              <name>VDDR1</name>
              <description>Port direction of P49/VWAKEUP pin set bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDDR0" -->
            <field>
              <name>VDDR0</name>
              <description>Port direction of P48/VREGCTL pin set bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBDIR" -->
        <register>
          <name>VBDIR</name>
          <description>Port Input Data Register [BHW]</description>
          <addressOffset>0xA8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VDIR3" -->
            <field>
              <name>VDIR3</name>
              <description>Port input data of P46/X0A pin bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDIR2" -->
            <field>
              <name>VDIR2</name>
              <description>Port input data of P47/X1A pin bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDIR1" -->
            <field>
              <name>VDIR1</name>
              <description>Port input data of P49/VWAKEUP pin bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDIR0" -->
            <field>
              <name>VDIR0</name>
              <description>Port input data of P48/VREGCTL pin bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBDOR" -->
        <register>
          <name>VBDOR</name>
          <description>Port Output Data Register [BHW]</description>
          <addressOffset>0xAC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0F</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VDOR3" -->
            <field>
              <name>VDOR3</name>
              <description>Port output data of P46/X0A pin bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDOR2" -->
            <field>
              <name>VDOR2</name>
              <description>Port output data of P47/X1A pin bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDOR1" -->
            <field>
              <name>VDOR1</name>
              <description>Port output data of P49/VWAKEUP pin bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDOR0" -->
            <field>
              <name>VDOR0</name>
              <description>Port output data of P48/VREGCTL pin bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBPZR" -->
        <register>
          <name>VBPZR</name>
          <description>Port Pseudo-Open Drain Set Register [BHW]</description>
          <addressOffset>0xB0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x03</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VPZR1" -->
            <field>
              <name>VPZR1</name>
              <description>P49/VWAKEUP pin pseudo-open drain set bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPZR0" -->
            <field>
              <name>VPZR0</name>
              <description>P48/VREGCTL pin pseudo-open drain set bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BREG00" -->
        <register>
          <name>BREG00</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
